InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Way_Points_Tracking/ESP-Now_ESP32-S3_Remote-Side-01/src/main.cpp
/**
 * @file main.cpp
 * @brief ESP32-S3 Remote-Side-01 â€” Ship Model Control System
 *
 * @description
 * Firmware sisi kapal (Remote-Side) yang mengumpulkan data sensor dan
 * actuator, menjalankan kontrol rudder/propeller, lalu mengirim telemetry
 * 23-kolom telemetry ke User-Side via ESP-NOW.
 *
 * Clone dari ESP_Now_Send_Ver2025_revJan2026.
 *
 * Hardware yang digunakan:
 * - Receiver RC (FS-iA6B) dengan output PPM
 * - Servo rudder dengan feedback potensiometer
 * - Motor propeller dengan rotary encoder (RPM measurement)
 * - GNSS module (u-blox GPS) via Serial1
 * - IMU (HWT905TTL) via Serial2
 * - ADC untuk monitoring baterai
 *
 * Fitur kontrol:
 * - Mode Manual: Kontrol rudder langsung dari RC (CH1)
 * - Mode Auto alg 1: waypoint + PD rudder (AUTO_TRACK_ALG=1)
 * - Mode Auto alg 2: stub kosong (AUTO_TRACK_ALG=2)
 *
 * @author Chandra P - Ship Model Control System
 * @version 1.0 (Remote-Side-01)
 * @date 2026
 *
 * @note
 * - Update rate: 10 Hz (setiap 100ms)
 * - Data dikirim dalam format fixed-point (Ã— 100) untuk efisiensi
 * - Struktur data harus sama dengan ESP-Now_ESP32-S3_User-Side (PENDING: penyesuaian)
 * - Penerimaan waypoint dari User-Side (dashboard -> User-Side -> ESP-NOW)
 */

#include <Arduino.h>
#include <ESP32Servo.h>
#include <TinyGPS++.h>
#include <Wire.h>
#include <JY901.h>
#include <esp_now.h>
#include <WiFi.h>
#include <math.h>

// ============================================================================
// ESP-NOW Configuration
// ============================================================================

/**
 * @brief MAC Address ESP32-S3 User-Side (peer ESP-NOW)
 *
 * @note UBAH MAC ADDRESS INI sesuai MAC User-Side Anda.
 */
// uint8_t user_side_Address[] = {0x10, 0x20, 0xba, 0x4c, 0x53, 0xfc};
uint8_t user_side_Address[] = {0x94, 0xa9, 0x90, 0x30, 0xab, 0xc0};

// =====================================================================
// Waypoints (diterima dari User-Side). HARUS identik dengan User-Side.
// Layout 180 byte (< 250 byte limit ESP-NOW):
//   msg_type, home_valid, wp_count, reserved, home_lat/lon, wp_lat/lon[10]
// =====================================================================
#define WP_MAX_COUNT 10
#define WP_MSG_TYPE  0xA1

// =====================================================================
// Pemilihan algoritma auto track (hardcode — ubah sebelum upload)
// =====================================================================
#define AUTO_TRACK_ALG 1       // 1 = waypoint haversine + PD, 2 = stub kosong
#define WP_ARRIVE_M    3.0f    // jarak (m) untuk advance ke waypoint berikutnya
#define AUTO_TRACK_KP  1.0f    // heading error (deg) -> rudder offset (deg)
#define AUTO_TRACK_KD  0.05f   // damping dari gyro_z (deg/s)
#define RUDDER_CMD_MAX 40.0f   // max offset rudder (deg)

typedef struct waypoints_payload {
  uint8_t  msg_type;
  uint8_t  home_valid;
  uint8_t  wp_count;
  uint8_t  reserved;
  double   home_lat;
  double   home_lon;
  double   wp_lat[WP_MAX_COUNT];
  double   wp_lon[WP_MAX_COUNT];
} waypoints_payload;

// Waypoint terakhir; auto_track() akan memakai ini saat diimplementasi.
static waypoints_payload g_lastWaypoints;
static bool              g_hasWaypoints = false;
static uint8_t           g_active_wp_index = 0;  // index waypoint aktif (0..wp_count-1)

esp_now_peer_info_t peerInfo;  ///< Peer info untuk ESP-NOW communication

/**
 * @brief Callback function yang dieksekusi ketika data ESP-NOW terkirim
 * 
 * @param mac_addr MAC address dari receiver
 * @param status Status pengiriman (ESP_NOW_SEND_SUCCESS atau ESP_NOW_SEND_FAIL)
 * 
 * @details
 * Function ini dipanggil setelah setiap pengiriman data ESP-NOW.
 * Digunakan untuk monitoring status pengiriman (optional, bisa di-comment).
 */
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
  // Serial.print("\r\nLast Packet Send Status:\t");
  // Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success" : "Delivery Fail");
}

static void printWaypoints(const waypoints_payload &wp) {
  Serial.print("[WP] msg_type=0x");
  Serial.print(wp.msg_type, HEX);
  Serial.print(" home_valid=");
  Serial.print(wp.home_valid);
  Serial.print(" count=");
  Serial.println(wp.wp_count);

  if (wp.home_valid) {
    Serial.print("[WP] Home: ");
    Serial.print(wp.home_lat, 6); Serial.print(", ");
    Serial.println(wp.home_lon, 6);
  } else {
    Serial.println("[WP] Home: <none>");
  }

  uint8_t n = wp.wp_count;
  if (n > WP_MAX_COUNT) n = WP_MAX_COUNT;
  for (uint8_t i = 0; i < n; i++) {
    Serial.print("[WP] #");
    Serial.print(i + 1);
    Serial.print(": ");
    Serial.print(wp.wp_lat[i], 6); Serial.print(", ");
    Serial.println(wp.wp_lon[i], 6);
  }
}

void OnDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
  if (len == (int)sizeof(waypoints_payload) && incomingData[0] == WP_MSG_TYPE) {
    memcpy(&g_lastWaypoints, incomingData, sizeof(g_lastWaypoints));
    g_hasWaypoints = true;
    g_active_wp_index = 0;
    Serial.print("[WP] Bytes received from User-Side: ");
    Serial.println(len);
    printWaypoints(g_lastWaypoints);
    Serial.println();
    return;
  }

  Serial.print("[WARN] Unknown ESP-NOW payload length: ");
  Serial.println(len);
}

// ============================================================================
// PPM (Pulse Position Modulation) Configuration
// ============================================================================

/**
 * @brief Konfigurasi PPM untuk receiver RC (FS-iA6B)
 * 
 * @details
 * PPM adalah format sinyal yang digunakan oleh receiver RC untuk mengirim
 * data dari semua channel dalam satu sinyal. Setiap channel direpresentasikan
 * oleh pulse width (dalam mikrodetik).
 */
#define PPM_PIN 4                    ///< GPIO pin untuk input PPM
#define CHANNEL_COUNT 8              ///< Jumlah channel PPM (FS-iA6B memiliki 8 channel)
#define PPM_SYNC_THRESHOLD 2500      ///< Threshold untuk sync pulse (Âµs) - nilai > ini adalah sync pulse
#define PPM_MIN_CHANNEL_VALUE 600    ///< Nilai minimum channel (Âµs) - FS-iA6B lowest
#define PPM_MAX_CHANNEL_VALUE 1600   ///< Nilai maksimum channel (Âµs) - FS-iA6B highest

// ============================================================================
// Rotary Encoder Configuration (RPM Measurement)
// ============================================================================

/**
 * @brief Konfigurasi rotary encoder untuk mengukur RPM motor propeller
 * 
 * @details
 * Rotary encoder menghasilkan pulse setiap kali motor berputar.
 * RPM dihitung dengan menghitung jumlah pulse per interval waktu.
 * Menggunakan moving average untuk smoothing data.
 */
#define PULSE_PIN_Motor_prop_1 9     ///< GPIO pin untuk encoder motor propeller 1
#define PULSE_PIN_Motor_prop_2 10    ///< GPIO pin untuk encoder motor propeller 2
volatile uint32_t pulse_counter_motor_prop_1 = 0;  ///< Counter kumulatif untuk motor 1
volatile uint32_t pulse_counter_motor_prop_2 = 0;  ///< Counter kumulatif untuk motor 2

/**
 * @brief Moving Average Configuration untuk smoothing RPM data
 * 
 * @details
 * Moving average digunakan untuk mengurangi noise pada pengukuran RPM.
 * Buffer menyimpan N sampel terakhir, kemudian dihitung rata-ratanya.
 */
#define RPM_SAMPLES_motor_prop_1 10  ///< Jumlah sampel untuk moving average motor 1
#define RPM_SAMPLES_motor_prop_2 10  ///< Jumlah sampel untuk moving average motor 2
uint32_t pulse_buffer_motor_prop_1[RPM_SAMPLES_motor_prop_1] = {0};  ///< Buffer untuk motor 1
uint32_t pulse_buffer_motor_prop_2[RPM_SAMPLES_motor_prop_2] = {0};  ///< Buffer untuk motor 2
uint8_t buffer_index_motor_prop_1 = 0;  ///< Index saat ini dalam buffer motor 1 (circular buffer)
uint8_t buffer_index_motor_prop_2 = 0;  ///< Index saat ini dalam buffer motor 2 (circular buffer)

// ============================================================================
// Timing Configuration
// ============================================================================

/**
 * @brief Interval timing untuk main loop
 * 
 * @details
 * Main loop berjalan setiap 100ms (10 Hz update rate).
 * Interval ini menentukan frekuensi update data dan pengiriman ESP-NOW.
 */
unsigned long previousMillis = 0;    ///< Waktu millis() sebelumnya untuk interval timing
const long intervaltime = 100;       ///< Interval waktu dalam ms (100ms = 10 Hz)

// ============================================================================
// Control Input Structure
// ============================================================================

/**
 * @struct ControlInput
 * @brief Struktur untuk menyimpan input kontrol dari receiver RC
 * 
 * @details
 * Data berasal dari PPM receiver RC yang sudah di-mapping ke range 1000-2000 Âµs
 * (standard servo range).
 */
struct ControlInput {
    uint16_t rudder;           ///< Channel 1: Kontrol rudder (manual)
    uint16_t propSpeed;        ///< Channel 3: Kecepatan motor propeller
    uint16_t propDirection;    ///< Channel 5: Arah motor propeller
    uint16_t mode_auto_manual; ///< Channel 6: Mode auto/manual (â‰¥1750: Auto, <1750: Manual)
};

volatile ControlInput controlInput = {0};  ///< Buffer untuk input kontrol dari RC
volatile uint16_t ppm_values[CHANNEL_COUNT] = {0};      ///< Nilai PPM mentah (600-1600 Âµs)
volatile uint16_t ppm_mapped[CHANNEL_COUNT] = {0};     ///< Nilai PPM yang sudah di-mapping (1000-2000 Âµs)
volatile uint8_t current_channel = 0;      ///< Channel PPM saat ini yang sedang diproses
volatile uint32_t rising_time = 0;         ///< Waktu rising edge untuk menghitung pulse width

// ============================================================================
// Servo Rudder Configuration
// ============================================================================

/**
 * @brief Konfigurasi Servo Rudder
 * 
 * @details
 * Servo menggunakan LEDC (LED Controller) dengan resolusi 12-bit (0-4095).
 * Servo standar menggunakan pulse width 1.0ms - 2.0ms pada frekuensi 50Hz.
 * 
 * Duty cycle calculation:
 * - 1.0ms pulse = 5% duty cycle = 205 (dari 4095)
 * - 1.5ms pulse = 7.5% duty cycle = 307 (neutral)
 * - 2.0ms pulse = 10% duty cycle = 410
 */
const uint32_t SERVO_DUTY_MIN = 205;      ///< Duty minimum (5% = 1.0ms pulse)
const uint32_t SERVO_DUTY_NEUTRAL = 307;  ///< Duty neutral (7.5% = 1.5ms pulse)
const uint32_t SERVO_DUTY_MAX = 410;      ///< Duty maksimum (10% = 2.0ms pulse)
uint32_t servo_duty = 307;  ///< Duty saat ini (start di posisi neutral)

/**
 * @brief Kalibrasi Servo Angle
 * 
 * @details
 * Konversi dari sudut (derajat) ke duty value:
 * - Reference: 307 duty = 90 derajat (neutral)
 * - Conversion: 12 duty = 5 derajat, jadi 1 derajat = 2.4 duty
 * - Range: 47.5Â° hingga 132.9Â° (sesuai dengan duty 205-410)
 */
const float REFERENCE_ANGLE = 90.0;        ///< Sudut referensi (neutral position)
const uint32_t REFERENCE_DUTY = 307;       ///< Duty referensi (neutral position)
const float DUTY_PER_DEGREE = 12.0 / 5.0; ///< Konversi: 2.4 duty per derajat
const float ANGLE_MIN = 47.5;              ///< Sudut minimum (205 duty)
const float ANGLE_MAX = 132.9;             ///< Sudut maksimum (410 duty)
uint32_t current_angle = 90;               ///< Sudut saat ini (start di 90Â°)
float servo_angle_current_offset = 0;     ///< Offset sudut dari posisi neutral (-40Â° hingga +40Â°)

