InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Way_Points_Tracking/ESP-Now_ESP32-S3_Remote-Side-01/src/main.cpp
// Servo Pin Configuration
// #define SERVO_RUDDER_PIN 5
uint8_t SERVO_RUDDER_pin = 5;
uint32_t SERVO_RUDDER_freq = 50;
uint8_t SERVO_RUDDER_resolution = 12;

// LEDC Configuration untuk Propeller Speed
uint8_t PROP_SPEED_pin = 6;  // GPIO 6 (SERVO_PROP_SPEED_PIN)
uint32_t PROP_SPEED_freq = 50;  // 50 Hz (sama seperti servo)
uint8_t PROP_SPEED_resolution = 12;  // 12-bit resolution

// LEDC Configuration untuk Propeller Direction
uint8_t PROP_DIRECTION_pin = 7;  // GPIO 7 (SERVO_PROP_DIRECTION_PIN)
uint32_t PROP_DIRECTION_freq = 50;  // 50 Hz (sama seperti servo)
uint8_t PROP_DIRECTION_resolution = 12;  // 12-bit resolution

// ADC Pin Configuration (for feedback reading)
// Jangan gunakan grup ADC2 jika akan menggunakan fitur WIFI ESP32-S3
uint8_t ADC_PIN_SERVO_1 = 8;  // GPIO8 = ADC1_7 pin for analog input (ESP32-S3)
uint8_t ADC_PIN_SERVO_2 = 3;  // GPIO3 = ADC1_2 pin for analog input (ESP32-S3)
uint8_t ADC_PIN_BATT_1 = 1;   // GPIO1 = ADC1_0 pin for analog input (ESP32-S3)
uint8_t ADC_PIN_BATT_2 = 2;   // GPIO2 = ADC1_1 pin for analog input (ESP32-S3)

// PWM for propeller
#define SERVO_PROP_SPEED_PIN 6
#define SERVO_PROP_DIRECTION_PIN 7

// Servo PWM parameters (range: 1000-2000 Âµs)
#define SERVO_MIN_US 1000
#define SERVO_MAX_US 2000
#define SERVO_HZ 50

// Note: servoPropSpeed dan servoPropDirection tidak digunakan lagi
// Semua PWM propeller sekarang menggunakan LEDC
// Servo servoPropSpeed;
// Servo servoPropDirection;

// Define the RX and TX pins for Serial 1 for GNSS
#define RXD1 18
#define TXD1 17

#define GPS_BAUD 9600

// The TinyGPS++ object
TinyGPSPlus gps;

// Create an instance of the HardwareSerial class for Serial 1
HardwareSerial gpsSerial(1);

// Simple container for parsed GPS data (snapshot per interval)
struct GpsData {
  double latitude;
  double longitude;
  double speedMps;
  // double altitudeM;
  // double hdop;
  // uint32_t satellites;
  // bool locationValid;
  // bool timeValid;
  // unsigned long locationAgeMs;
  // unsigned long timeAgeMs;
};

GpsData latestGpsData{};

// Define the RX and TX pins for Serial 2 for hwt905ttl
#define RXD2 16
#define TXD2 15

//#define HWT905TTL_BAUD 57600
#define HWT905TTL_BAUD 115200

// Create an instance of the HardwareSerial class for Serial 2
HardwareSerial HWT905TTL_Serial(2);

// Struct data untuk pengiriman/logging ringkas
struct DatatoSend {
  double timestamp;       // detik sejak boot (millis()/1000.0)
  double latitude;        // dari latestGpsData.latitude
  double longitude;       // dari latestGpsData.longitude
  uint16_t speedMps;      // dari latestGpsData.speedMps (Ã— 100, range 0-655.35 m/s)
  int16_t Calc_deg_servo_1; // derajat hasil kalkulasi feedback servo 1 (Ã— 100)
  int16_t Calc_deg_servo_2; // derajat hasil kalkulasi feedback servo 2 (x 100)
  uint16_t yaw;           // derajat yaw (x 100, 0-360 deg)
  uint16_t heading_setpoint;  // bearing ke waypoint aktif (deg x 100, 0-360)
  int16_t  heading_error;     // setpoint - yaw, wrap +-180 (deg x 100)
  int16_t  rudder_cmd;        // perintah rudder offset dari netral (deg x 100, +-40)
  uint8_t  track_wp_index;    // waypoint aktif: 0=tidak auto, 1..N=WP#, 255=home
  uint16_t distance_to_wp;    // jarak ke waypoint aktif (meter x 10)
  int16_t accel_x;        // akselerometer X (g x 100)
  int16_t accel_y;        // akselerometer Y (g x 100)
  int16_t accel_z;        // akselerometer Z (g x 100)
  int16_t gyro_x;         // gyroscope X (deg/s x 100)
  int16_t gyro_y;         // gyroscope Y (deg/s x 100)
  int16_t gyro_z;         // gyroscope Z (deg/s x 100)
  uint16_t rpm_prop_1;    // rpm motor propeller 1 (x 100)
  uint16_t rpm_prop_2;    // rpm motor propeller 2 (Ã— 100)
  uint16_t battery_1;     // batere for ESP32-S3, Servo, HWT905TTL, Receiver RC, GNSS, Rotary Encoder (Ã— 100)
  uint16_t battery_2;     // batere for motor propeller (Ã— 100)
  uint8_t mode_auto;      // 0: manual, 1: auto alg1 (PD track), 2: auto alg2 (stub)
};

DatatoSend dataToSend;

// Utility: map long to float with custom output range
static inline float mapFloat(long x, long in_min, long in_max, float out_min, float out_max) {
  return (float)(x - in_min) * (out_max - out_min) / (float)(in_max - in_min) + out_min;
}

/**
 * @brief Interrupt handler untuk PPM signal
 * 
 * @details
 * Function ini dipanggil setiap kali terjadi perubahan level pada PPM_PIN
 * (CHANGE interrupt). Menggunakan edge detection untuk mengukur pulse width.
 * 
 * PPM Format:
 * - Sync pulse: Pulse panjang (>2500Âµs) menandai awal frame
 * - Channel pulses: Pulse pendek (600-1600Âµs) adalah nilai channel
 * 
 * @note
 * Function ini harus dideklarasikan dengan IRAM_ATTR karena dipanggil dari interrupt.
 * Semua variabel yang diakses harus volatile.
 */
void IRAM_ATTR ppm_interrupt_handler() {
  uint32_t current_time = micros();
  
  if (digitalRead(PPM_PIN) == HIGH) {
      // ========== RISING EDGE ==========
      // Simpan waktu untuk menghitung pulse width
      rising_time = current_time;
  } else {
      // ========== FALLING EDGE ==========
      // Hitung durasi HIGH (pulse width = channel value)
      uint32_t pulse_width = current_time - rising_time;
      
      // Detect sync pulse (HIGH period panjang menandai awal frame)
      if (pulse_width > PPM_SYNC_THRESHOLD) {
          current_channel = 0;  // Reset ke channel pertama
      } else {
          // Simpan channel value jika dalam range valid
          if (current_channel < CHANNEL_COUNT) {
              ppm_values[current_channel] = pulse_width;
              current_channel++;
          }
      }
  }
}

/**
 * @brief Interrupt handler untuk rotary encoder motor propeller 1
 * 
 * @details
 * Function ini dipanggil setiap kali terjadi rising edge pada PULSE_PIN_Motor_prop_1.
 * Increment counter untuk menghitung jumlah pulse (putaran motor).
 * 
 * @note
 * Function ini harus dideklarasikan dengan IRAM_ATTR karena dipanggil dari interrupt.
 * Counter harus volatile karena diakses dari interrupt dan main loop.
 */
void IRAM_ATTR pulse_interrupt_handler_motor_prop_1() {
  pulse_counter_motor_prop_1++;  // Increment counter pada rising edge
}

/**
 * @brief Interrupt handler untuk rotary encoder motor propeller 2
 * 
 * @details
 * Function ini dipanggil setiap kali terjadi rising edge pada PULSE_PIN_Motor_prop_2.
 * Increment counter untuk menghitung jumlah pulse (putaran motor).
 * 
 * @note
 * Function ini harus dideklarasikan dengan IRAM_ATTR karena dipanggil dari interrupt.
 * Counter harus volatile karena diakses dari interrupt dan main loop.
 */
void IRAM_ATTR pulse_interrupt_handler_motor_prop_2() {
  pulse_counter_motor_prop_2++;  // Increment counter pada rising edge
}

// ---------------------- u-blox helpers (CFG-PRT / CFG-RATE / CFG-CFG) ----------------------
// UBX checksum calculator (CK_A, CK_B) over class, id, length(2), payload
void ubxChecksum(const uint8_t *payload, uint16_t length, uint8_t &ckA, uint8_t &ckB) {
  ckA = 0;
  ckB = 0;
  for (uint16_t i = 0; i < length; i++) {
    ckA = ckA + payload[i];
    ckB = ckB + ckA;
  }
}

